
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |    Destroy |
|:---------:|--------:|-----------:|-----------:|
|     ✅     |       2 |          4 |          0 |
## Affected resources by action

|  Action  | Resources                                                                         |
|:--------:|:----------------------------------------------------------------------------------|
|    🟢     | `aws_iam_role_policy_attachment.registry-client["terraform-aws-tags-override"]`   |
|    🟢     | `module.registry-client-roles["terraform-aws-tags-override"].aws_iam_role.github` |
|    🟡     | `module.ecs.module.pod.aws_autoscaling_group.website`                             |
|    🟡     | `module.ecs.module.pod.aws_launch_template.website`                               |
|    🟡     | `module.keycloak.module.pod.aws_autoscaling_group.website`                        |
|    🟡     | `module.keycloak.module.pod.aws_launch_template.website`                          |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_role_policy_attachment.registry-client["terraform-aws-tags-override"] will be created
  + resource "aws_iam_role_policy_attachment" "registry-client" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::493370826424:policy/registry-client20240303235455581600000001"
      + role       = "ih-tf-terraform-aws-tags-override-github"
    }

  # module.registry-client-roles["terraform-aws-tags-override"].aws_iam_role.github will be created
  + resource "aws_iam_role" "github" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-tags-override:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role for a GitHub Actions runner in repo terraform-aws-tags-override"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ih-tf-terraform-aws-tags-override-github"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/github-role/aws"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/github-role/aws"
          + "environment"       = "production"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs.module.pod.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "terraf2024030219493674520000000d"
        name                             = "terraf2024030219493674520000000d"
        # (28 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0b338e0594e73e11a"
            name    = "terraf2024030219493659230000000b"
          ~ version = "2" -> (known after apply)
        }

        # (7 unchanged blocks hidden)
    }

  # module.ecs.module.pod.aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                      = "lt-0b338e0594e73e11a"
      ~ image_id                = "ami-0c535e24abbf12738" -> "ami-0d0dff554c5ff1f89"
      ~ latest_version          = 2 -> (known after apply)
        name                    = "terraf2024030219493659230000000b"
        tags                    = {}
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.keycloak.module.pod.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "auth2024030222363784960000000d"
        name                             = "auth2024030222363784960000000d"
        # (28 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0d93139ab32de43aa"
            name    = "auth2024030222363750480000000b"
          ~ version = "2" -> (known after apply)
        }

        # (7 unchanged blocks hidden)
    }

  # module.keycloak.module.pod.aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                      = "lt-0d93139ab32de43aa"
      ~ image_id                = "ami-0c535e24abbf12738" -> "ami-0d0dff554c5ff1f89"
      ~ latest_version          = 2 -> (known after apply)
        name                    = "auth2024030222363750480000000b"
        tags                    = {}
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDIsICJjaGFuZ2UiOiA0LCAiZGVzdHJveSI6IDB9fQ==
```
</details>